In [12]:
import pandas as pd

In [37]:
df_movies = pd.read_csv('IMDb movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [38]:
#select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

In [39]:
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

# 1 Concat
## 1.1 Concatenate vertically

In [3]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['E', 'F', 'G', 'H'],
                    'age': [40, 21, 19, 24]})

In [17]:
pd.concat([df1, df2], axis=0, ignore_index=True)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  H   24

## 1.1.1 Exercise

In [24]:
#extract a 50% sample of the original dataframe(df_movies)
df_sample = df_movies.sample(frac=0.5)
df_sample

,imdb_title_id,title,year,genre,country
20751,tt0085178,Ardh Satya,1983,"Crime, Drama",India
9334,tt0051062,Teenage Doll,1957,"Crime, Drama, Film-Noir",USA
39759,tt0278291,Ajnabee,2001,"Action, Crime, Drama",India
60767,tt1679290,Shuttlecock Boys,2011,"Comedy, Drama",India
46501,tt0431170,Joseph Smith: Prophet of the Restoration,2005,"Biography, Drama, History",USA
...,...,...,...,...,...
55575,tt1220217,The Legend of Hell's Gate: An American Conspiracy,2011,"Action, Adventure, History",USA
6792,tt0043455,Davide e Betsabea,1951,"Drama, History, Romance",USA
22996,tt0092563,Angel Heart - Ascensore per l'inferno,1987,"Horror, Mystery, Thriller","UK, Canada, USA"
41134,tt0301563,Love's Brother,2004,"Comedy, Drama, Romance","Australia, UK"
13726,tt0063586,Sette volte sette,1969,"Comedy, Crime","Italy, UK"

In [23]:
#shape of dataframe that we contcatenate
df_sample.shape

(42928, 5)

In [26]:
#concatenate df movies and df_sample
df_concat_vertical = pd.concat([df_movies, df_sample])

In [27]:
#shape
df_concat_vertical.shape

(128783, 5)

## 2.1 Concatenate horizontally

In [28]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'job': ['Doctor', 'Engineer', 'Accountant', 'Developer']})

In [33]:
df_concat_horizontal = pd.concat([df1, df2], axis=1)
df_concat_horizontal

  id  age         job
0  A   30      Doctor
1  B   23    Engineer
2  C   25  Accountant
3  D   22   Developer

## 1.2.1 Exercise

In [41]:
#shape of dataframes that we contcatenate
print(df_movies.shape)
print(df_ratings.shape)

(85855, 5)
(85855, 3)

In [49]:
df_movies.set_index('imdb_title_id', inplace=True)
df_ratings.set_index('imdb_title_id', inplace=True)

In [50]:
#concatenate df_movies and df_ratings on 'imdb_title_id'(horizontally)
df_concat_horizontal=pd.concat([df_movies, df_ratings], axis=1)
df_concat_horizontal

,title,year,genre,country,total_votes,mean_vote
imdb_title_id,,,,,,
tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...
tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

In [51]:
#shape
df_concat_horizontal.shape

(85855, 6)